Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: གཙེ་བ་མང་ཞིང་ཆར་ཆེས་པའི་དུས་ཀྱི་ཚེ་ཆར་མི་འབབ་པའི་དུས་ཀྱི་ཚེ། དུས་མ་ཡིན་པར་ཆར་འབབ་པའི་དུས་ཀྱི་ཚེ།
en: It was a time of great calamites, of excessive rains, and of droughts.

source: སྦྲུལ་འབྱུང་བའི་དུས་ཀྱི་ཚེ།
en: It was a time of many snakes.

source: ལྕེ་འབབ་པའི་དུས་ཀྱི་ཚེ།
en: It was a time of disasters caused by lightning.

source: མུ་གེ་འབྱུང་བའི་དུས་ཀྱི་ཚེ།
en: It was a time of famines.

source: ལོག་པར་ལྟ་བའི་དུས་ཀྱི་ཚེ།
en: It was a time of false views.

source: ཡང་དག་པ་མ་ཡིན་པར་ལྟ་བའི་དུས་ཀྱི་ཚེ།
en: It was a time of wrong views.

source: མུ་སྟེགས་ཅན་གྱི་གསང་སྔགས་ཡོངས་སུ་ཚོལ་བའི་དུས་ཀྱི་ཚེ།
en: It was a time of seeking out the mantras of the tīrthikas.

source: སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་རབ་ཏུ་འཇིག་པར་འགྱུར་བའི་དུས་ཀྱི་ཚེ།
en: It was the time when the enlightenment of buddhahood was vanishing.

source: བྱང་ཆུབ་སེམས་དཔའ་བདུན་སྟོང་གྲོང་དང་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དང་ལྗོངས་ནས་བསྐྲད་ནས་དེ་དག་ཆོས་སྨྲ་བ་མེ་ཏོག་ཟླ་མཛེས་དང་ལྷན་ཅིག་ཀུན་དུ་བཟང་པོ་ཞེས་བྱ་བའི་ནགས་ཁྲོད་དེར་རྟེན་ཅིང་གནས་ཏེ་དགེ་སློང་དེ་དག་ལ་གཟུངས་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྟོན་ཏོ།
en: “Seven thousand bodhisattvas were expelled from the villages, the towns, the market towns, the regions, the capital, and the kingdom. They, along with the dharmabhāṇaka Supuṣpacandra, resorted to the forest called Samantabhadra and dwelt there. Supuṣpacandra taught those bhikṣus there the Dharma teaching of retention.

source: །ཀུན་དགའ་བོ་ནགས་ཁྲོད་དེ་ཡང་དུས་ཐམས་ཅད་དུ་སྣང་བའི་མེ་ཏོག་སྣ་ཚོགས་དང་། སྙེ་མ་དང་། འཁྲི་ཤིང་དང་། འབྲས་བུ་དག་དང་ལྡན་པ། དཔག་བསམ་གྱི་ཤིང་དང་འདྲ་བ།
en: “Ānanda, in that forest a variety of flowers, blossoms, vines, and fruits were always displayed, and the forest was filled with a variety of trees that were like wish-fulfilling trees.

source: ཤིང་སྣ་ཚོགས་ཀྱིས་གང་ཞིང་སའི་གཞི་ཡང་གཟུགས་དང་ཁ་དོག་དུ་མ་དང་ས་བོན་དང་མྱུ་གུ་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: The ground was covered with the adornment of many different forms and colors of seeds and seedlings;

source: བྲག་དང་རྡོ་བ་སྣ་ཚོགས་མཛེས་ཤིང་དྲི་མ་མེད་པ། ཡངས་ཤིང་མཐོ་བ་དང་གསེར་གྱི་རི་དག་གིས་མཛེས་པར་བྱས་ཤིང་སྡུག་པ།
en: beautified by a variety of rocks and stones, and stainless water; and adorned by beautiful, vast, high, golden mountains.

source: གྲུབ་པའི་རིག་སྔགས་འཆང་དང་དྲི་ཟའམ་སྐྱེས་བུའམ་དྲང་སྲོང་དང་མིའམ་ཅི་དག་གནས་པ།
en: Siddhas, vidyādharas, gandharvas, yakṣas, kiṃpuruṣas, sages, and kinnaras dwelt there.

source: བྱད་གཟུགས་དང་ཁ་དོག་ཆེ་ཞིང་རྣམ་པ་སྣ་ཚོགས་མང་པོ་གནས་པ།
en: It was inhabited by flocks of birds of various colors and shapes.

source: སངས་རྒྱས་དུ་མ་བཞུགས་བཞུགས་པ།
en: Many buddhas had dwelt there.

source: དགའ་ཚལ་དང་འདྲ་བ་ཀུན་ཏུ་བཟང་ཞིང་རྣལ་འབྱོར་དང་འཐུན་པའི་ནགས་ཚལ་དམ་པ་ཀུན་ཏུ་བཟང་པོ་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་རྣལ་འབྱོར་ལ་རྗེས་སུ་བརྩོན་ཞིང་གནས་པར་གྱུར་ཏོ།
en: It was like a delightful garden. It was completely good. It was in that excellent forest called Samantabhadra, perfect for practice, that those bodhisattvas dedicated to practice dwelt.

source: །ཡང་ཀུན་དགའ་བོ་ཆོས་སྨྲ་བ་མེ་ཏོག་ཟླ་མཛེས་དེ་གཅིག་པུ་དབེན་པར་སོང་ནས།
en: “Ānanda, the dharmabhāṇaka Supuṣpacandra went to stay alone in a secluded place.

source: ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་ཏེ། ལྷའི་མིག་རྣམ་པར་དག་པ་མིའི་ལས་འདས་པས་བལྟས་ན། བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་མང་པོ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་སངས་རྒྱས་ཀྱི་ཞིང་སྣ་ཚོགས་ནས་འདིར་སྐྱེས་ཏེ།
en: With his pure divine sight, which transcended that of humans, he saw that many trillions of bodhisattvas who had developed roots of goodness in various buddha realms had been reborn in this world.

source: དེ་དག་གཟུངས་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མཉན་པ་རྙེད་ན་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར།
en: If they were able to hear this Dharma teaching of retention they would proceed irreversibly to the highest, complete enlightenment.

source: གལ་ཏེ་གཟུངས་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མཉན་པ་མ་རྙེད་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་ལྡོག་པ་དག་མཐོང་ངོ་།
en: However, if they did not hear this Dharma teaching of retention they would regress from the highest, complete enlightenment.

source: །དེ་ནས་ཆོས་སྨྲ་བ་མེ་ཏོག་ཟླ་མཛེས་དྲན་ཞིང་ཤེས་བཞིན་དུ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་ག་ལ་ཡོད་པ་དེར་སོང་སྟེ་ཕྱིན་ནས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Then the dharmabhāṇaka Supuṣpacandra mindfully and knowingly arose from that samādhi and went to the great assembly of bodhisattvas.

source: །རིགས་ཀྱི་བུ་དག་ཁོ་བོ་ནི་འགྲོའོ། །གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་འདབ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་སོང་ལ་སེམས་ཅན་རྣམས་ལ་ཆོས་བསྟན་པར་བྱའོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་དེ་དག་གིས་ཆོས་སྨྲ་བ་མེ་ཏོག་ཟླ་མཛེས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: When he had reached it, he announced to that great assembly of bodhisattvas, ‘Noble sons, I am going to the villages, the towns, the market towns, the kingdom, the regions, and the capital, where I will teach the Dharma to beings.’

source: །ཁྱོད་ནགས་ཁྲོད་འདི་ནས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་འདབ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དུ་འགྲོ་བ་འདི་ནི་ཁོ་བོ་ཅག་འདོད་པ་མ་ཡིན་ནོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “The great assembly of bodhisattvas said to the dharmabhāṇaka Supuṣpacandra, ‘We do not wish you to go from this forest to the villages, the towns, the market towns, the kingdom, the regions, and the capital. Why?

source: དགེ་སློང་དང་དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་དགེ་བསྙེན་མ་ལྷག་པའི་ང་རྒྱལ་ཅན་མང་པོ་དམ་པའི་ཆོས་སྤོང་བ་དག་བྱུང་བའི་དུས་ལ་བབ་ཀྱིས།
en: Because the time has come when there are many bhikṣus and bhikṣuṇīs, upāsakas and upāsikās who are extremely arrogant and have rejected the good Dharma.

source: དེ་དག་ཚེ་དང་ལྡན་པའི་སྲོག་གཅོད་པར་གྱུར་ན་མ་ལེགས་སོ།
en: Brother, it will not be good if they kill you.

source: །ཚེ་དང་ལྡན་པ་ནི་ཤིན་ཏུ་མཛེས་ཤིང་བྱད་བཞིན་བཟང་ལ་བལྟ་ན་སྡུག་སྟེ། དང་པོའི་ལང་ཚོ་དང་ལྡན་ཞིང་། ན་ཚོད་དར་ལ་བབ་སྟེ། མདོག་ནི་གསེར་བཙོ་མ་བཟང་པོ་འདྲ།
en: “ ‘Brother, you are very handsome, attractive, and good looking, in the flush of youth, a young adult, with a complexion that is like excellent polished gold.

source: དཔྲལ་བ་ནི་དུང་དང་ཟླ་བ་དང་མེ་ཏོག་ཀུན་དའི་ཁ་དོག་ལྟ་བུའི་མཛོད་སྤུས་བརྒྱན།
en: On your forehead there is the adornment of an ūrṇā hair that is like a conch, the moon, or a jasmine flower.

source: སྐྲ་དང་གཙུག་ཏོར་ནི་མཐོན་མཐིང་ལ་ལྕང་ལོར་འཁྱིལ་པ་ཡིན་པས་རྒྱལ་པོའམ་རྒྱལ་པོའི་བློན་པོའམ། དེ་དང་འདྲ་བ་གཞན་དག་ཀྱང་ཕྲག་དོག་དང་འཇུངས་པས་ནོན་པའི་སེམས་ཀྱིས་ཁྱོད་ཀྱི་སྲོག་བཅད་ན་མ་ལེགས་སོ།
en: Your hair and uṣṇīṣa are blue-black, and the locks of your hair curl. Therefore the princes, the king’s ministers, and such others will be envious, hostile, and aggressive, and if they kill you that would not be good.’

source: །དེ་ནས་ཆོས་སྨྲ་བ་མེ་ཏོག་ཟླ་མཛེས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་དེ་ལ་འདི་སྐད་དུ་གལ་ཏེ་ཁོ་བོས་བདག་ཉིད་བསྲུང་བ་བྱས་ན་ཁོ་བོས་འདས་པ་དང་མ་བྱོན་པ་དང་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བསྟན་པ་བསྲུང་བར་མི་འགྱུར་རོ། །ཞེས་ཟེར་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །བདག་ཏུ་འདུ་ཤེས་འདི་ལ་གནས་ནས་སུ།
en: “Then the dharmabhāṇaka Supuṣpacandra said to the great assembly of bodhisattvas, ‘If I protect myself I cannot protect the teaching of the past, future, and present buddha bhagavāns.’ Thereupon he recited these verses:

source: །བསྟན་པ་འདི་ལ་བསྲུང་བར་ཡོང་མི་ནུས།
en: “ ‘I cannot protect this teaching While maintaining the concept of a self.

source: །མི་བཟད་ཕྱི་དུས་བདེ་བར་གཤེགས་པ་ཡི།
en: In these dreadful latter times there is the great presentation

source: །བྱང་ཆུབ་བསྟན་པ་བཀོད་པ་ཆེན་པོ་ཡིན།
en: Of the Sugata’s teaching of enlightenment. {1}

source: །གང་གིས་བདག་ཏུ་འདུ་ཤེས་ཀུན་སྤངས་ཤིང་།
en: “ ‘The one who completely abandons the concept of self

source: །སེམས་ཅན་འདི་དང་གང་ཟག་སྨྲ་གནས་དང་། །གཟུགས་དང་སྒྲ་དང་དྲི་དང་རོ་རྣམས་དང་། །རེག་བྱ་སྤོང་བ་དེ་ནི་བསྟན་པ་བསྲུང་།
en: And the doctrine of an individual that these beings follow, The one who abandons form, sound, smell, Taste, and touch, is one who protects the teaching. {2} “ ‘Compared to someone who, with a pure mind,

source: །བསྐལ་པ་བྱེ་བ་གང་གཱའི་བྱེ་སྙེད་དུ།
en: Has honored for millions of eons, as numerous as the Ganges sands,

source: །དང་བའི་སེམས་ཀྱིས་ཟས་དང་སྐོམ་རྣམས་དང་། །གདུགས་དང་བ་དན་མར་མེའི་ཕྲེང་བ་ཡིས།
en: Quintillions of buddhas with food, drink,

source: །སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་རིམ་གྲོ་བྱས།
en: Parasols, flags, and rows of lights, {3}

source: །གང་གིས་དམ་ཆོས་རབ་ཏུ་འཇིག་པ་དང་། །བདེ་གཤེགས་བསྟན་པ་འགག་པར་འགྱུར་བའི་ཚེ། །ཉིན་མཚན་དུ་ནི་བསླབ་པ་གཅིག་སྤྱོད་པ།
en: “ ‘Another who practices a single teaching day and night When the good Dharma is being destroyed, When the Sugata’s teaching is coming to an end,

source: །བསོད་ནམས་འདི་ནི་དེ་བས་བྱེ་བྲག་འཕགས།
en: Will have merits that are far greater than the first {4} “ ‘Someone who cultivates indifference

source: །སྐྱེས་བུ་ཁྱུ་མཆོག་གི་ནི་དམ་པའི་ཆོས། །འཇིག་པར་འགྱུར་ཚེ་གང་དག་བཏང་སྙོམས་སྒོམ།
en: While the good Dharma of the leader of beings is being destroyed

source: །དེ་ཡིས་རྒྱལ་བ་བཀུར་སྟི་བྱས་མ་ཡིན།
en: Is not showing respect for the Jina

source: །འདྲེན་པ་དག་ལ་རི་མོར་དེས་མ་བྱས།
en: And is not honoring the guides. {5}

source: །ཁྱེད་བདེ་རང་གི་དོན་གྱིས་ལ།
en: “ ‘You should remain happy

source: །བདག་ཉིད་རབ་ཏུ་བསྲུང་བར་གྱིས།
en: And preserve your own welfare.

source: །ཁྱེད་ནི་རྟག་ཏུ་བྱམས་གནས་ཤིང་།
en: Always be kind and take care Of those who are to be guided.

source: །འདུལ་བ་འདི་ལ་བག་ཡོད་གྱིས།
en: Sincerely maintain

source: །མ་འདྲེས་དག་གཙང་དྲི་མེད་པ། །ཚུལ་ཁྲིམས་དྲང་པོར་བསྲུང་བར་གྱིས།
en: Unalloyed, pure, pristine, stainless conduct.

source: །གང་གིས་ཚུལ་ཁྲིམས་དྲི་མ་མེད།
en: Those who keep their conduct stainless

source: །སངས་རྒྱས་བསྔགས་པ་བསྲུངས་པ་ནི།
en: Are praised by the buddhas. {6} “ ‘Those who have honored

source: །དེ་ཡིས་ཇི་སྙེད་སྔོན་བྱུང་བ། །བདེ་གཤེགས་ཐམས་ཅད་རི་མོར་བྱས།
en: The buddhas in the past

source: །དེ་ཡིས་ཐམས་ཅད་བསྐྱབས་པ་ཡིན།
en: Are protectors who lead all beings

source: །སྐྱེ་བོའི་ཚོགས་རྣམས་བྱང་ཆུབ་བཀོད།
en: To enlightenment. Those who keep the stainless conduct

source: །སྔོན་གྱི་སངས་རྒྱས་དག་གིས་བསྟོད་པ་ཡི། །ཚུལ་ཁྲིམས་དྲི་མ་མེད་པ་སུས་བསྲུངས་པ།
en: That has been praised by the past buddhas

source: །དེ་དག་གིས་ནི་སེམས་ཅན་མང་པོ་ཡང་།
en: Become those who save many beings

source: །སེམས་ཅན་དམྱལ་བ་དང་ནི་སྡིག་ལས་དྲངས།
en: From the hells and from bad karma. {7}

source: །ཆོས་མཆོག་རིན་ཆེན་སྦྱིན་པ་སྦྱིན་པར་གྱིས།
en: “ ‘Give the precious gift of the supreme Dharma

source: །བཟོད་པ་དག་ཀྱང་རྟག་ཏུ་བསྲུང་གྱིས་ལ།
en: And always maintain patience.

source: །དགོན་པར་གནས་ཤིང་ཏིང་འཛིན་མཁས་པ་དང་། །འཇམ་ཞིང་མཉེན་པ་དག་ཀྱང་བསྒོམ་པར་གྱིས།
en: Remain in solitude, be skilled in samādhi, Meditate, and be gentle.

source: །རྣམ་པ་ཀུན་ཏུ་རྩོད་པ་མ་བྱེད་པར།
en: Never engage in quarrels

source: །སྤྱད་པ་ཞི་མཆོག་འདི་ལ་རྣམ་པར་སྤྱོད།
en: And maintain supreme, peaceful conduct. I am going to the capital,

source: །བདག་ནི་སེམས་ཅན་རྣམས་ཀྱང་བསྐྱབ་པའི་ཕྱིར། །གྲོང་དང་རྒྱལ་པོའི་ཕོ་བྲང་འགྲོ་བར་བྱ།
en: To the city, in order to protect beings.’ {8}

source: །བློ་གྲོས་ཆེ་འཆང་སེམས་ཅན་དམ་པའི་མཆོག །དྲང་སྲོང་དེ་ནི་འགྲོ་བར་བྱས་པ་དང་། །ཁ་ཅིག་རྐང་པ་ལ་ཡང་འཇུ་བར་བྱེད།
en: “When that sage, the supreme, sublime being Who had great realization, was leaving, Some held him by his feet,

source: །སྙིང་རྗེ་བར་ཡང་ངུ་ཞིང་མཆི་མ་ཟག །མཁས་པ་བློ་གྲོས་ཆེན་པོ་མ་བཞུད་པར།
en: Weeping with compassion and shedding tears. ‘Wise one with great realization, do not leave!

source: །སྒྲ་འཇམ་ཡིད་དུ་འོང་ཞིང་མཛེས་པ་ཡི། །ཤིང་འདི་རྣམས་ལ་གཟིགས་ཤིང་རྟོགས་པ་མཛོད།
en: Look at how beautiful are this charming forest’s trees, With their sweet and fragrant aromas.

source: །བདག་ཉིད་བསྲུང་བ་མཛོད་ལ་མ་བཞུད་ཅིག །སྔོན་གྱི་སྟོབས་བཅུ་འདྲེན་པ་དེ་དག་ཀྱང་།
en: Protect yourself, and do not leave. {9} “ ‘The guides of the past, who had the ten strengths,

source: །དབང་པོ་ཞི་ཞིང་ཤིན་ཏུ་དེས་པ་རྣམས།
en: Who had pacified senses, and kindness,

source: །ནགས་ཚལ་བྲག་དང་རི་ཡི་རྩེར་གཤེགས་ནས། །བྱང་ཆུབ་དམ་པ་དག་ནི་ཐུགས་སུ་ཆུད།
en: Went to forests, cliffs, and mountain summits And there reached the highest enlightenment.

source: །བྱང་ཆུབ་རྒྱུར་ཡང་སྤྱོད་པ་དམ་པ་སྤྱད།
en: They practiced the highest conduct, enlightenment’s cause.

source: །དེ་དག་བསོད་ནམས་ཡེ་ཤེས་མཆོག་དང་ལྡན།
en: They possessed supreme merit and wisdom.

source: །དེ་དག་རྗེས་སློབས་ནགས་ཁྲོད་གནས་པར་མཛོད།
en: Follow their example and remain in the forest.

source: །བརྟུལ་ཞུགས་བཟང་པོ་འདི་ནས་མ་བཞུད་ཅིག །ལུས་ནི་ཤིན་ཏུ་མཛེས་པའི་མཚན་གྱིས་བརྒྱན།
en: You, who have perfect discipline, do not leave. {10} “ ‘Your beautiful body is adorned by the signs.

source: །ཁྱོད་ཀྱི་སྐྲ་ཡང་མཐོན་མཐིང་ཁ་དོག་སྟེ།
en: Your hair is blue-black in color,

source: །གསེར་གྱི་ཁ་དོག་དང་འདྲ་འོད་བྱེད་པ།
en: You shine with the color of gold

source: །ས་འདི་ཀུན་ཀྱང་རབ་ཏུ་སྣང་བར་གྱུར།
en: And you illuminate this earth.

source: །ཁྱོད་ཀྱི་མཛོད་སྤུ་བཞིན་གྱི་སྨིན་མཚམས་ན།
en: An ūrṇā hair is between your eyebrows,

source: །ཤིན་ཏུ་མཛེས་པ་དུང་དང་འདྲ་བའི་འོད།
en: As beautiful and bright as a conch.

source: །རྒྱལ་པོ་དག་ཀྱང་དེ་བཞིན་སྲིད་ཀྱི་ཕྱིར།
en: The king and his followers will thus

source: །ཕྲག་དོག་བསྐྱེད་ནས་ཁྱོད་ཀྱི་ལུས་བཤིག་འགྱུར།
en: Become envious and destroy your body.’ {11}

source: །དེ་ནས་ཆོས་སྨྲ་བ་མེ་ཏོག་ཟླ་མཛེས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་དེ་ལ་ཚིགས་སུ་བཅད་པས་སྨྲས་པ།
en: “Then the dharmabhāṇaka Supuṣpacandra recited the following verses to that great assembly of bodhisattvas:

source: ཇི་སྙེད་སྔོན་གྱི་བདེ་གཤེགས་བྱུང་བ་ནི།
en: “ ‘The sugatas who lived in the past

source: །ཐམས་ཅད་མཁྱེན་ཅིང་ཟག་པ་ཟད་པ་རྣམས།
en: Were omniscient and without outflows.

source: །དེ་དག་ཐམས་ཅད་འཇིག་རྟེན་དོན་མཛད་དེ།
en: They all benefited the world

source: །སྲིད་པ་གསུམ་དུ་བྱང་ཆུབ་དམ་པ་རྟོགས།
en: And reached supreme enlightenment within the three existences.

source: །སྤྱད་པའི་དམ་པ་བྱང་ཆུབ་རྒྱུ་སྤྱད་དེ།
en: They practiced the highest conduct, enlightenment’s cause.

source: །དེ་ཡི་རྗེས་བསླབས་བྱང་ཆུབ་སེམས་དཔའ་ཡང་།
en: Follow their example, bodhisattvas,

source: །སེམས་ཅན་ཁྲག་ཁྲིག་རྣམས་ཀྱི་སྐྱབས་བྱེད་འདོད།
en: In order to protect millions of beings.’ {12}

source: །དྲང་སྲོང་མཁས་ལ་ཀུན་གྱིས་བསྐོར་བྱས་ཏེ།
en: “They all circumambulated the wise sage

source: །རྐང་པ་ལ་ཡང་ཕྱག་འཚལ་ཤུགས་ཕྱུང་ནས།
en: And they bowed down to his feet.

source: །མི་བཟད་སྙིང་རྗེ་བར་ནི་སྒྲ་འབྱིན་ཅིང་།
en: Overwhelmed with compassion, they cried out,

source: །ཉམ་ཐག་མི་བདེ་ཆོ་ངེས་འབེབས་པར་བྱེད།
en: Distressed, unhappy, wailing, and collapsing.

source: །ཁ་ཅིག་རབ་ཏུ་འགྱེལ་ཅིང་བརྒྱལ་ནས་སུ།
en: Some lost consciousness and fainted,

source: །ས་ལ་ལྷུང་བ་སཱ་ལ་བཅད་འགྱེལ་བཞིན།
en: Falling to the ground like sal trees that had been cut down.

source: །འོན་ཀྱང་དྲང་སྲོང་སེམས་ཅན་དོན་འདོད་པ།
en: But the sage, determined to benefit beings

source: །བསོད་ནམས་བསགས་པས་དེ་ལས་ཕྱིར་མི་ལྡོག །དྲང་སྲོང་ཆོས་གོས་ལྷུང་བཟེད་ཐོགས་ནས་ཆས།
en: Through his accumulation of merit, did not turn back. {13} “The sage took up his robes and bowl

source: །ཇི་ལྟར་སེང་གེ་རལ་པ་ཅན་དག་བཞིན།
en: And was prepared, like the maned lion.

source: །དེ་ནི་ཆོས་ཀྱི་རང་བཞིན་གནས་པས་ན།
en: He remained in the nature of the Dharma

source: །དེ་ལ་ཡོན་ཏན་ཉེས་པར་བྱ་བ་མེད།
en: And was unaffected by good or bad qualities.

source: །འཇིག་རྟེན་འདིར་ན་ནགས་ཁྲོད་བདག་གནས་པས།
en: If in this world I remain in this forest,

source: །སེམས་ཅན་ངན་སོང་སོང་ན་མ་ལེགས་ཤེས།
en: Beings will fall into lower realms, which would not be good.

source: །དེ་ནི་སེམས་ཅན་བསྐྱབ་པའི་དོན་གྱི་ཕྱིར།
en: Therefore in order to protect beings

source: །གྲོང་ཁྱེར་ཕོ་བྲང་མཆོག་ཏུ་སོང་བར་གྱུར།
en: I am going to the city and the supreme palace.’ {14}

source: །དེ་ནས་ཆོས་སྨྲ་བ་མེ་ཏོག་ཟླ་མཛེས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ལྗོངས་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་དུ་འོངས་ནས་སེམས་ཅན་རྣམས་ལ་ཆོས་བསྟན་ཏེ།
en: “So the dharmabhāṇaka Supuṣpacandra went to the villages, the towns, the market towns, the kingdom, the regions, and the capital, where he taught the Dharma to beings.

source: དེའི་སྔ་དྲོ་དེར་འོངས་ནས་སྲོག་ཆགས་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུ་རྩ་དགུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་བཀོད་དོ།
en: In the morning as he was going there, he established nine hundred and ninety million beings in irreversible progress toward the highest enlightenment, and that was before he had reached the capital city of Ratnāvatī.

source: །ད་དུང་རྒྱལ་པོའི་ཕོ་བྲང་དེར་མ་ཕྱིན་པས་དེ་མཐར་གྱིས་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་པ་དེར་ཕྱིན་པ་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་པ་དེར་ཉེ་བར་སོང་སྟེ། ཤིང་བླག་ཤ་དང་སཱ་ལའི་དྲུང་དུ་འདུག་གོ།
en: Once he had reached the capital city of Ratnāvatī, and was at the side of the capital city of Ratnāvatī, he sat at the feet of a wavy-leaf fig tree and a sal tree.

source: །དེ་དེའི་ནུབ་མོ་འདས་པ་དང་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་དུ་ཞུགས་པར་གྱུར་ཏེ།
en: “When that night had passed he went into the capital city of Ratnāvatī.

source: ཞུགས་ནས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་སངས་རྒྱས་ཀྱི་ཆོས་ལས་ཕྱིར་མི་ལྡོག་པར་བཀོད་ཀྱང་ད་དུང་ཟས་ཀྱི་བྱ་བ་མ་བྱས་སོ།
en: After entering inside he established three hundred and sixty million beings irreversibly in the Dharma.

source: །དེ་ཟས་གཅད་པ་བཅད་ནས་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་ནས་བྱུང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་སེན་མོའི་མཆོད་རྟེན་གང་ན་ཡོད་པ་དེར་སོང་སྟེ།
en: However, he had not had his meal and therefore, fasting that day, he emerged from the capital city of Ratnāvatī and went to the stūpa that contained the fingernail of the Bhagavān;

source: འགྲེང་བཞིན་དུ་ཉིན་མཚན་འདས་པར་བྱས་སོ།
en: there he stood all day and night.

source: །དེ་དེའི་ནུབ་མོ་འདས་ནས་དེ་སྔ་དྲོ་གཉིས་པ་ལ་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་དུ་ཞུགས་ནས་སྲོག་ཆགས་བྱེ་བ་ཕྲག་ཉི་ཤུ་རྩ་གསུམ་སངས་རྒྱས་ཀྱི་ཆོས་ལས་ཕྱིར་མི་ལྡོག་པར་བཀོད་དེ་ད་དུང་ཟས་ཀྱི་བྱ་བ་མ་བྱས་སོ།
en: “When that night was over, on the second morning, he went back into the capital city of Ratnāvatī. After entering inside he established two hundred and thirty million beings irreversibly in the Dharma.

source: །དེ་ཟས་གཉིས་པ་གཅད་པ་བཅད་ནས་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་ནས་བྱུང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་སེན་མོའི་མཆོད་རྟེན་གང་ན་ཡོད་པ་དེར་སོང་སྟེ།
en: However, he had not had his meal and therefore, fasting for a second day, he emerged from the capital city of Ratnāvatī and went to the stūpa that contained the fingernail of the Bhagavān;

source: །དེ་དེའི་ནུབ་མོ་འདས་ནས་དེ་སྔ་དྲོ་གསུམ་པ་ལ་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་དུ་ཞུགས་ནས་སྲོག་ཆགས་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་སངས་རྒྱས་ཀྱི་ཆོས་ལས་ཕྱིར་མི་ལྡོག་པར་བཀོད་དེ་ད་དུང་ཟས་ཀྱི་བྱ་བ་མ་བྱས་སོ།
en: “When that night was over, on the third morning, he went back into the capital city of Ratnāvatī. After entering inside he established nine hundred and ninety million beings irreversibly in the Dharma.

source: །དེ་ཟས་གསུམ་པ་གཅད་པ་བཅད་ནས་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་ནས་བྱུང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་སེན་མོའི་མཆོད་རྟེན་གང་ན་ཡོད་པ་དེར་སོང་ནས་འགྲེང་བཞིན་དུ་ཉིན་མཚན་འདས་པར་བྱས་སོ།
en: However, he had not had his meal and therefore, fasting for a third day, he emerged from the capital city of Ratnāvatī and went to the stūpa that contained the fingernail of the Bhagavān; there he stood all day and night.

source: །དེ་དེའི་ནུབ་མོ་འདས་ནས་དེ་སྔ་དྲོ་བཞི་པ་ལ་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་དུ་ཞུགས་ནས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་བཀོད་དེ་ད་དུང་ཟས་ཀྱི་བྱ་བ་མ་བྱས་སོ།
en: “When that night was over, on the fourth morning, he went back into the capital city of Ratnāvatī. After entering inside he established nine million, nine hundred thousand beings in irreversible progress toward the highest enlightenment.

source: །དེ་ཟས་བཞི་པ་གཅད་པ་བཅད་ནས་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་ནས་བྱུང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་སེན་མོའི་མཆོད་རྟེན་གང་ན་ཡོད་པ་དེར་སོང་ནས་འགྲེང་བཞིན་དུ་ཉིན་མཚན་འདས་པར་བྱས་སོ།
en: However, he had not had his meal and therefore, fasting for a fourth day, he emerged from the capital city of Ratnāvatī and went to the stūpa that contained the fingernail of the Bhagavān;

source: །དེ་དེའི་ནུབ་མོ་འདས་ནས་དེ་སྔ་དྲོ་ལྔ་པ་ལ་བཙུན་མོའི་འཁོར་གྱི་ནང་དུ་སོང་ནས་བུད་མེད་བརྒྱད་ཁྲི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་བཀོད་དོ།
en: there he stood all day and night. “When that night was over, on the fifth morning, he went back into the capital city of Ratnāvatī and entered the harem. After entering inside he established eighty thousand women in irreversible progress toward the highest enlightenment.

source: །གྲོང་ཁྱེར་དེ་ནས་ཀྱང་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་བཀོད་དེ་ད་དུང་ཟས་ཀྱི་བྱ་བ་མ་བྱས་སོ།
en: He also established countless, innumerable townspeople in irreversible progress toward the highest enlightenment.

source: །དེ་ཉི་མ་ལྔ་ཟས་གཅད་པ་བཅད་ནས་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་ནས་བྱུང་སྟེ།
en: However, he had not had his meal and therefore, fasting for a fifth day, he emerged from the capital city of Ratnāvatī and went to the stūpa that contained the fingernail of the Bhagavān;

source: བཅོམ་ལྡན་འདས་ཀྱི་སེན་མོའི་མཆོད་རྟེན་གང་ན་ཡོད་པ་དེར་སོང་ནས་འགྲེང་བཞིན་དུ་ཉིན་མཚན་འདས་པར་བྱས་སོ།
en: there he stood all day and night.

source: །དེ་དེའི་ནུབ་མོ་འདས་ནས་དེ་སྔ་དྲོ་དྲུག་པ་ལ་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་དུ་ཞུགས་ནས་རྒྱལ་པོའི་བུ་སྟོང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་བཀོད་དེ་ད་དུང་ཟས་ཀྱི་བྱ་བ་མ་བྱས་སོ།
en: “When that night was over, on the sixth morning, he went back into the capital city of Ratnāvatī. He established the thousand sons of the king in irreversible progress toward the highest enlightenment.

source: །དེ་ཉི་མ་དྲུག་ཟས་གཅད་པ་བཅད་ནས། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་ནས་བྱུང་སྟེ། བཅོམ་ལྡན་འདས་ཀྱི་སེན་མོའི་མཆོད་རྟེན་གང་ན་ཡོད་པ་དེར་སོང་ནས་འགྲེང་བཞིན་དུ་ཉིན་མཚན་འདས་པར་བྱས་སོ།
en: However, he had not had his meal and therefore, fasting for a sixth day, he emerged from the capital city of Ratnāvatī and went to the stūpa that contained the fingernail of the Bhagavān; there he stood all day and night.

source: །དེ་དེའི་ནུབ་མོ་འདས་ནས་དེ་སྔ་དྲོ་བདུན་པ་ལ་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རིན་ཆེན་ལྡན་དུ་ཞུགས་པ་དང་རྒྱལ་པོ་དཔའ་བས་བྱིན་སྐྱེད་མོས་ཚལ་དུ་འགྲོ་བ་མཐོང་སྟེ། གསེར་གྱི་ཤིང་རྟ་ལ་ངོས་ནི་དངུལ་མདའ་ནི་སྦྲུལ་གྱི་སྙིང་པོའི་ཙན་དན། འཁོར་ལོ་ནི་བཻ་དཱུརྱ། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་བསྒྲེང་བ་དང་། རིན་པོ་ཆེའི་ཤིང་རྟ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ།
en: “When that night was over, on the seventh morning, he went back into the capital city of Ratnāvatī. After entering inside he saw King Śūradatta riding toward the park in a chariot of made of gold with side panels of silver, shafts of uragasāra sandalwood, wheels of beryl, and adorned by a parasol, banners, and flags.

source: ཤིང་རྟའི་མདའ་ལ་དར་གྱིས་དཀྲིས་ཤིང་རས་བཅོས་བུ་ཕྲུགས་ཀྱིས་གཡོགས་པ་དེ་བུ་མོ་གཞོན་ནུ་བརྒྱད་བརྒྱས་རིན་པོ་ཆེའི་ཐ་གུས་བཏགས་ཤིང་འདྲེན་ཏེ།
en: The chariot’s shafts were bound with silk and tied with cotton ribbons. Eight hundred maidens were pulling the chariot with precious cords.

source: དེ་དག་བྱད་བཞིན་བཟང་ཞིང་མཛེས་པ། བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོ་རྒྱས་པའི་མཆོག་དང་ལྡན་པ།
en: They were beautiful, pretty, and attractive, with perfect, lovely complexions.

source: བྱིས་པ་རྣམས་དགའ་བར་བྱེད་ཅིང་ཚིམ་པར་བྱེད་པ་སྟེ། མཁས་པ་རྣམས་ལ་ནི་མ་ཡིན་ནོ།
en: They brought delight and satisfaction to the foolish but not to the wise.

source: །རྒྱལ་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་ཞབས་འབྲིང་མཐོན་དམན་དུ་འགྲོའོ། །བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་ཞབས་འབྲིང་མཐོན་དམན་དུ་འགྲོའོ།
en: “Eighty-four thousand kṣatriyas, who were like great sal trees, followed in the rear. Eighty-four thousand brahmins, who were also like great sal trees, followed in their rear.

source: །ཁྱིམ་བདག་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡང་ཞབས་འབྲིང་མཐོན་དམན་དུ་འགྲོའོ།
en: Eighty-four thousand prominent citizens, they, too, like great sal trees, followed in their rear.

source: །རྒྱལ་པོའི་བུ་མོ་ལྔ་བརྒྱ་ཡང་རིན་པོ་ཆེའི་ཁྱོགས་ཀྱི་ནང་དུ་ཞུགས་ནས་མདུན་ཐོག་ཐག་ཏུ་འགྲོ་སྟེ། དེ་དག་གིས་དགེ་སློང་དེ་མཐོང་མ་ཐག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: “The king’s five hundred daughters were being carried in precious palanquins in front, and when they saw the bhikṣu they were instantly established in irreversible progress toward the highest enlightenment.
